const labels = {
  general: {
    or: 'чи',
    click: 'Тисни',
    levels: 'Рівень',
  },
  buttons: {
    nextLevel: 'Наступний рівень',
    retry: 'Знову цей',
    play: 'Грати',
    showAnswer: 'Відповідь',
    back: 'Назад',
  },
  tutorial: {
    title: 'Правила',
    oneCharIsDifferent: 'Один символ відрізняється від інших',
    andTry: 'та спробуй його знайти якомога швидше',
  },
  win: {
    title: ['Добре!'],
    newRecord: '🎉 Новий рекорд!',
    currentTime: 'Твій час',
    bestResult: 'Твій найкрашчий час',
    challengeYourself: 'Спробуйте',
    retryInsanity: 'Покращіть свій найкращий результат! ',
  },
  levels: {
    fieldset: 'Виберіть рівень складності',
    easy: 'Легкий',
    medium: 'Помірний',
    hard: 'Важкий',
    ninja: 'Ніндзя',
    insanity: 'Божевілля',
  },
  settings: {
    settings: 'Налаштування',
    language: 'Мова',
    theme: 'Тема',
    backDescription: 'до гри',
    avatar: {
      alt: 'Рандомна аватарка',
    },
  },
};

export default labels;
